Tekla.Structures.Model.ModelObjectSelector
The ModelObjectSelector class can be used to make different model object selections
from the current model.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectSelector Selector = Model.GetModelObjectSelector();
ModelObjectEnumerator listObjects = Selector.GetAllObjects();
foreach(ModelObject MO in listObjects)
{
Beam B = MO as Beam;
if(B != null)
{
Solid solid = B.GetSolid();
}
}
}
}

Tekla.Structures.Model.ModelObjectSelector.#ctor
Should be called only from Model (to simulate "current model" connection...)

Tekla.Structures.Model.ModelObjectSelector.GetAllObjects
Returns an enumerator of all the model objects in the current model.
Returns: A model object enumerator of all the model objects.

Tekla.Structures.Model.ModelObjectSelector.GetAllObjectsWithType(Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Returns an enumerator of all the model objects in the current model with the given type.
Enum: The type of the objects to return.
Returns: A model object enumerator of all the model objects with the given type.

Tekla.Structures.Model.ModelObjectSelector.GetAllObjectsWithType(System.Type[])
Returns an enumerator of all the model objects in the current model with the given base type.
In the following example a connection to the Tekla Structures model is established and
all parts and boolean objects are fetched for enumeration from the model.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
System.Type[] Types = new System.Type[2];
Types.SetValue(typeof(Part),0);
Types.SetValue(typeof(Boolean),1);
ModelObjectEnumerator myEnum = Model.GetModelObjectSelector().GetAllObjectsWithType(Types);
}
}
TypeFilter: The types of the objects to return.
Returns: A model object enumerator of all the model objects with the given types.

Tekla.Structures.Model.ModelObjectSelector.GetObjectsByBoundingBox(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns an enumerator of the model objects in the current model colliding with the given
geometrical bounding box. Note that this method uses approximate bounding
boxes and thus is NOT EXACT, and may return objects not necessarily colliding
with the given box but only being somewhere near to it.
MinPoint: The minimum point of the bounding box.
MaxPoint: The maximum point of the bounding box.
Returns: A model object enumerator of the model objects colliding with the given bounding box.

Tekla.Structures.Model.ModelObjectSelector.GetEnumerator
Returns an enumerator of all the model objects in the current model.
Returns: A model object enumerator of all the model objects.

Tekla.Structures.Model.ModelObjectSelector.GetObjectsByFilterName(System.String)
Returns an enumerator of the model objects in the current model selected by the given selection
filter.
FilterName: The name of an existing selection filter to apply.
Returns: A model object enumerator of the objects selected by the filter.

Tekla.Structures.Model.ModelObjectSelector.GetFilteredObjectsWithType(Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.String)
Returns an enumerator of the model objects in the current model with the given type and selected by the filter.
Enum: The type of the objects to return.
FilterName: The name of an existing selection filter to apply.
Returns: A model object enumerator of the model objects with the given type and selected by the filter.

Tekla.Structures.Model.ModelObjectSelector.GetObjectsByFilter(Tekla.Structures.Filtering.FilterExpression)
Returns an enumerator of the model objects in the current model selected by the given selection filter definition.
FilterExpression: The definition of a selection filter to apply.
Returns: A model object enumerator of the objects selected by the filter.